Tekla Open API Reference for Tekla Structures 2025
ViewCamera.ZoomFactor Property
The camera zoom factor (meter/pixel) in the orthogonal view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ZoomFactor { get; set; }
Public Property ZoomFactor As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace